<?php
return [
    'select' => '---',
    'title' => 'عنوان',
    'upload_file' => 'انتخاب تصاویر',
    'drag_photo' => 'یا تصاویر موردنظرتان را درگ کنید',
    'upload' => 'آپلود تصاویر',
    'proceed' => 'تصاویر پردازش‌شده',
    'successfully' => 'ایمیل شما در خبرنامه با موفقیت ثبت شد. لطفا به منظور فعال سازی عضویت خود بر روی لینکی که به ایمیل شما ارسال گردیده است، کلیک نمایید.',
    'active' => 'شما عضو خبرنامه هستید.',
    'not_active' => 'ایمیل موردنظر ثبت شده است. به منظور فعال‌سازی بر روی لینکی که قبلا به ایمیل شما ارسال شده است کلیک نمایید تا عضویت شما در خبرنامه فعال شود.',
    'reset_password' => 'لینک بازیابی رمز عبور با موفقیت ارسال گردید.',
	'login_fail' => 'نام کاربری یا کلمه عبور اشتباه است.',
	'add_product_features' => 'افزودن مشخصات محتوا',
	'feature' => 'ویژگی',
	'remove' => 'حذف',
	'add_feature' => 'افزودن ویژگی',
	'submit_features' => 'ثبت مشخصات محتوا'
];
