<?php
return [
	1 => 'فعال',
	2 => 'غیرفعال',
	3 => 'منقضی شده است',
	4 => 'بلاک شده است',
	5 => 'موجود',
	6 => 'ناموجود',
	7 => 'به زودی',
	8 => 'توقف تولید',
	9 => 'توقف واردات',
	10 => 'ناموفق',
	11 => 'موفق',
	12 => 'بررسی شده است',
	13 => 'به بانک ارسال شده است',
	14 => 'در حال ارسال',
	15 => 'ارسال شد',
	16 => 'خطا داد',
	16 => 'ثبت اولیه',
	17 => 'به درگاه بانک رفته',
	18 => 'در حال بررسی',
	19 => 'درحال آماده سازی',
	20 => 'تحویل به سیستم حمل و نقل',
	21 => 'سفارش لغو گردید',
	22 => 'سفارش تحویل داده شده است',
	// 'select' => 'انتخاب',
	// 'address' => 'آدرس دهی',
	// 'checkout' => 'قبل پرداخت',
	// 'failed' => 'پرداخت نا موفق',

	// 'paid' => 'پرداخت شده', // confirm
	// 'paycredit' => 'پرداخت شده با اعتبار', //confirm
	// 'willpay' => 'پرداخت در محل', // confirm

	// 'prepare' => 'آماده سازی لیست', // proccess
	// 'preparewillpay' => 'آماده سازی لیست شما', // proccess

	// 'send' => 'سفارش در راه است', // proccess
	// 'sendwillpay' => 'سفارش در راه است و هزینه در محل پرداخت می شود', // proccess

	// 'receive' => 'تحویل داده شده',
	// 'receivewillpay' => 'تحویل داده شده و هزینه دریافت شد',

	// 'reject' => 'ارسال ناموفق',
	// 'rejectwillpay' => 'ارسال ناموفق و عدم دریافت هزینه',

	// 'confirm' => 'درانتظار تایید',
	// 'check' => 'در صف بررسی',
	// 'process' => 'در حال پردازش',
];