<?php
return [
    'permissions' => [
        1 => 'agent', 
        2 => 'coworker',
        3 => 'marketer',
        4 => 'general_manager',
        5 => 'content_manager',
        6 => 'product_manager',
        7 => 'factor_manager',
        8 => 'advertise_manager',
        9 => 'forum_manager',
        10 => 'user_manager',
        11 => 'payment_manager',
        12 => 'category_manager',
        13 => 'comment_manager',
        14 => 'developer',
    ],
    'provinces' => [
        1 => "آذربايجان شرقي",
        2 => "آذربايجان غربي",
        3 => "اردبيل",
        4 => "اصفهان",
        5 => "البرز",
        6 => "ايلام",
        7 => "بوشهر",
        8 => "تهران",
        9 => "چهارمحال و بختياري",
        10 => "خراسان رضوي",
        11 => "خراسان شمالي",
        12 => "خراسان جنوبي",
        13 => "خوزستان",
        14 => "زنجان",
        15 => "سمنان",
        16 => "سيستان و بلوچستان",
        17 => "فارس",
        18 => "قزوين",
        19 => "قم",
        20 => "كردستان",
        21 => "كرمان",
        22 => "كرمانشاه",
        23 => "كهگيلويه و بويراحمد",
        24 => "گلستان",
        25 => "گيلان",
        26 => "لرستان",
        27 => "مازندران",
        28 => "مركزي",
        29 => "هرمزگان",
        30 => "همدان",
        31 => "يزد",
    ],
    'cities' => [
        1 => [
            'تبریز','مراغه','مرند','میانه','اهر','سراب','بناب','شبستر','آذرشهر','ملکان','اسکو','بستان‌آباد',
            'هریس','عجب','شیر','هشترود','جلفا','کلیبر','ورزقان','خداآفرین','چاراویماق'
        ],
        2 => [
            'ارومیه','خوی','میاندوآب','بوکان','مهاباد','سلماس','پیرانشهر','نقده','سردشت','شاهین دژ','ماکو',
            'تکاب','اشنویه','شوط','چالدران','چایپاره','پلدشت'
        ],
        3 => [
            'اردبیل','پارس‌آباد','مشگین شهر','خلخال','گرمی','نمین','بیله سوار','کوثر','نیر','سرعین'
        ],
        4 => [
            'اصفهان','کاشان','خمینی شهر','نجف‌آباد','فلاورجان','لنجان','شاهین شهر و میمه','شهرضا','مبارکه',
            'برخوار','آران و بیدگل','گلپایگان','فریدن','تیران و کرون','سمیرم','نطنز','اردستان','فریدون‌شهر',
            'نایین','دهاقان','چادگان','خوانسار','خور و بیابانک'
        ],
        5 => [
            'کرج','ساوجبلاغ','نظرآباد','طالقان'
        ],
        6 => [
            'ایلام','شیروان و چرداول','دهلران','دره شهر','ایوان','آبدانان','مهران','ملکشاهی'
        ],
        7 => [
            'بوشهر','دشتستان','کنگان','گناوه','دشتی','تنگستان','دیر','جم','دیلم'
        ],
        8 => [
            'تهران','شهریار','ورامین','بهارستان','اسلامشهر','ملارد','ری','پاکدشت','قدس','رباط کریم','دماوند',
            'پیشوا','شمیرانات','فیروزکوه','کرج','ساوجبلاغ','نظرآباد','طالقان'
        ],
        9 => [
            'شهرکرد','لردگان','بروجن','فارسان','کیار','اردل','کوهرنگ'
        ],
        10 => [
            'مشهد','نیشابور','سبزوار','تربت جام','تربت حیدریه','قوچان','کاشمر','چناران','خواف','تایباد','فریمان','سرخس','گناباد','درگز','بردسکن','زاوه','رشتخوار','بینالود','جوین','باخرز','خلیل‌آباد','مه‌ولات','جغتای','تخت جلگه','کلات','خوشاب','بجستان'
        ],
        11 => [
            'بجنورد','شیروان','اسفراین','مانه و سملقان','فاروج','جاجرم','گرمه'
        ],
        12 => [
            'بیرجند','قاینات','طبس','نهبندان','درمیان','فردوس','سربیشه','سرایان','بشرویه'
        ],
        13 => [
            'اهواز','دزفول','بندر ماهشهر','آبادان','ایذه','شوش','شوشتر','بهبهان','اندیمشک','خرمشهر','شادگان','مسجدسلیمان','باغ ملک','رامهرمز','دشت آزادگان','امیدیه','باوی','گتوند','اندیکا','رامشیر','هندیجان','لالی','هویزه','هفتگل'
        ],
        14 => [
            'زنجان','خدابنده','ابهر','خرمدره','طارم','ماهنشان','ایجرود'
        ],
        15 => [
            'شاهرود','سمنان','دامغان','گرمسار','مهدی‌شهر'
        ],
        16 => [
            'زاهدان','چاه‌بهار','زابل','ایرانشهر','نیک شهر','سراوان','سرباز','خاش','کنارک','زهک','سیب و سوران','هیرمند','دلگان','مهرستان'
        ],
        17 => [
            'شیراز','مرودشت','کازرون','لارستان','جهرم','فسا','داراب','فیروزآباد','ممسنی','نی ریز','آباده','اقلید','سپیدان','لامرد','کوار','زرین دشت','استهبان','قیروکارزین','خرامه','مهر','خرم بید','بوانات','گراش','رستم','فراشبند','ارسنجان','خنج','سروستان','پاسارگاد'
        ],
        18 => [
            'قزوین','البرز','تاکستان','بویین‌زهرا','آبیک'
        ],
        19 => [
            'قم'
        ],
        20 => [
            'سنندج','سقز','مریوان','قروه','بانه','کامیاران','بیجار','دیواندره','دهگلان','سروآباد'
        ],
        21 => [
            'کرمان','رفسنجان','جیرفت','سیرجان','بم','زرند','رودبار جنوب','شهربابک','کهنوج','عنبرآباد','قلعه گنج','بافت','بردسیر','فهرج','ریگان','منوجان','نرماشیر','ارزوئیه','راور','انار','فاریاب','رابر','کوهبنان'
        ],
        22 => [
            'کرمانشاه','اسلام‌آباد غرب','سنقر','هرسین','سرپل ذهاب','کنگاور','صحنه','جوانرود','گیلانغرب','پاوه','روانسر','دالاهو','ثلاث باباجانی','قصرشیرین'
        ],
        23 => [
            'بویراحمد','کهگیلویه','گچساران','دنا','بهمئی','چرام','باشت'
        ],
        24 => [
            'گرگان','گنبد کاووس','علی‌آباد','آق قلا','کلاله','آزادشهر','رامیان','مینودشت','ترکمن','کردکوی','گمیشان','گالیکش','مراوه تپه','بندر گز'
        ],
        25 => [
            'رشت','تالش','لاهیجان','رودسر','بندر انزلی','لنگرود','صومعه سرا','آستانه اشرفیه','رودبار','فومن','آستارا','رضوانشهر','شفت','ماسال','سیاهکل','املش'
        ],
        26 => [
            'خرم‌آباد','بروجرد','کوهدشت','دورود','دلفان','الیگودرز','پلدختر','سلسله','ازنا','دوره'
        ],
        27 => [
            'بابل','ساری','آمل','قائم‌شهر','بهشهر','تنکابن','نوشهر','بابلسر','چالوس','نکا','نور','محمودآباد','جویبار','رامسر','سوادکوه','فریدونکنار','میاندرود','عباس آباد','گلوگاه'
        ],
        28 => [
            'اراک','ساوه','شازند','خمین','خنداب','زرندیه','محلات','دلیجان','کمیجان','فراهان','تفرش','آشتیان'
        ],
        29 => [
            'بندرعباس','میناب','بندر لنگه','رودان','قشم','بستک','حاجی‌آباد','خمیر','جاسک','سیریک','پارسیان','بشاگرد','ابوموسی'
        ],
        30 => [
            'همدان','ملایر','نهاوند','کبودرآهنگ','بهار','رزن','اسدآباد','تویسرکان','فامنین'
        ],
        31 => [
            'یزد','میبد','اردکان','ابرکوه','تفت','مهریز','بافق','خاتم','صدوق','بهاباد'
        ]
    ]
];
